Tekla Open API Reference for Tekla Structures 2025
StraightDimension.Attributes Property
 Gets or sets the dimension's attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public StraightDimension.StraightDimensionAttributes Attributes { get; set; }
Public Property Attributes As StraightDimension.StraightDimensionAttributes
	Get
	Set
Property Value
Type: StraightDimension.StraightDimensionAttributes
See Also
Reference
StraightDimension Class
Tekla.Structures.Drawing Namespace